#+title: ObjC 1: Basic Objective-C Programming
#+date: 2025-04-05
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: lisp
*** The =@autorealeasepool=
根据 [[https://stackoverflow.com/a/10290255][stackoverflow]] 上的这个帖子, 可以参考 [[https://developer.apple.com/documentation/foundation/nsautoreleasepool][文档]], 会发现用
=[[NSAutoreleasePool alloc] init]= 不如 =@autoreleasepool=.

通过 Clang transcompile 的结果里面, 可以发现:

#+begin_src c
  struct __AtAutoreleasePool {
    __AtAutoreleasePool() {atautoreleasepoolobj = objc_autoreleasePoolPush();}
    ~__AtAutoreleasePool() {objc_autoreleasePoolPop(atautoreleasepoolobj);}
    void * atautoreleasepoolobj;
  };
#+end_src

于是可以通过直接调用 =objc_autoreleasePoolPush()= 以及
=objc_autorelasePoolPop()= 来解决这个问题.

于是可以尝试:

#+begin_src lisp
  (defmacro with-autorelease-pool (&body body)
    `(let ((autorelease-pool-obj (objc-autorelease-pool-push)))
       (unwind-protect (progn ,@body)
         (objc-autorelease-pool-pop autorelease-pool-obj))))
#+end_src

#+begin_html
<details><summary>对自动生成的 binding 的 patch</summary>
#+end_html

这里发现在原本自动生成的绑定里面缺少了 =objc_autoreleasePoolPush= 和
=objc_autoreleasePoolPop= 这两个函数, 一开始以为是被移除的 API, 但是发现
貌似在我的电脑上也不是不能直接调用, 于是就直接进行一个的引用:

#+begin_src lisp
  (defcfun (objc-autorelease-pool-push "objc_autoreleasePoolPush") :pointer)

  (defcfun (objc-autorelease-pool-pop "objc_autoreleasePoolPop") :void
    (autorelease-pool-obj :pointer))
#+end_src

#+begin_html
</details>
#+end_html

当然, 在 LispWorks 里面的写法应该是这样的 (类似如此):

#+begin_src lisp
  (with-autorelease-pool ()
    (ns-log (invoke "NSString" "stringWithUTF8String:" "ObjC Test")))
#+end_src

我的目标就是去模拟这个表示方式... 可以如下地实现:

#+name: ns-log-example
#+begin_src lisp :results output
  (with-autorelease-pool ()
    (ns-log
     (foreign-funcall "objc_msgSend"
                      :pointer (coerce-to-objc-class "NSString")
                      :pointer (coerce-to-selector "stringWithUTF8String:")
                      :string  "OBJC Test"
                      :pointer)))
#+end_src

#+RESULTS:
: 2025-04-03 00:00:59.293 sbcl[98401:25666096] OBJC Test

#+begin_html
<details><summary>这里为什么不用绑定的函数? </summary>
#+end_html

因为自动生成的的绑定是这样的:

#+begin_src lisp
  (defcfun (objc-msg-send "objc_msgSend") :void
    (self objc-id)
    (op   objc-sel)
    &rest)
#+end_src

由于其是 =:void= 返回值, 其没法传值给 =ns-log=. 其中 =ns-log= 定义如下:

#+begin_src lisp
  (defcfun (ns-log "NSLog") :void
    (formatter :pointer)
    &rest)
#+end_src

#+begin_html
</details>
#+end_html

